aytacdilek/NUCLEO_W5500/drivers/stm32f10x_sd.c
/*******************************************************************************
 * @File:			stm32f10x_sd.c
 * @Author:			Aytac Dilek
 * @email:			aytacdilek@gmail.com
 * @Web:
 * @Date:			03.01.2018
 * @Description:	STM32F10x library for SD Memory
 * @Version:		1.0
 * @Platform:		NUCLEO-F103RB
 * @CPU:			STM32F103RB
 * @IDE:			CooCox CoIDE 1.7.8
 * @GCC:			7.2.1 2017q4
 * @Module:			spi
 * @Function:		Ethernet Controller
 * @Notes:			None
*******************************************************************************/

/* Includes *******************************************************************/
#include "stm32f10x_sd.h"

u8 SD_Type = 0; // SD card type



/* Internal Functions *********************************************************/
#ifdef STM32_SD_USE_DMA
// #warning "Information only: using DMA"
/*-----------------------------------------------------------------------*/
/* Transmit/Receive Block using DMA (Platform dependent. STM32 here)     */
/*-----------------------------------------------------------------------*/
static void stm32_dma_transfer(uint8_t receive, const BYTE *buff, uint16_t btr);
#endif


/*******************************************************************************
* Function:		sd_init
* Description:	Initialize SD card
* Input:		None
* Output:		None
* Return:		Return if successful, it will automatically set the speed to 18Mhz SPI
* 				0: NO_ERR
* 				1: TIME_OUT
* 				99: NO_CARD
* Attention:	None
*******************************************************************************/
uint8_t sd_init(void){
	GPIO_InitTypeDef GPIO_InitStructure;
	SPI_InitTypeDef  SPI_InitStructure;

	/*!< SD CS/MOSI/MISO/CLK Pin GPIO Peripheral clock enable */
	RCC_APB1PeriphClockCmd(	SD_SPI_SCK_GPIO_CLK |
							SD_SPI_MISO_GPIO_CLK |
							SD_SPI_MOSI_GPIO_CLK |
							SD_SPI_CS_GPIO_CLK, ENABLE);
	/*!< SD_SPI Peripheral clock enable */
#if defined(SD_ENABLE_SPI1)
	/* Initialize GPIO Peripheral */
	RCC_APB2PeriphClockCmd(SD_SPI_CLOCK, ENABLE);
#elif defined(SD_ENABLE_SPI2)
	RCC_APB1PeriphClockCmd(SD_SPI_CLOCK, ENABLE);
#endif
	/*!< Configure SD_SPI pins: SCK */
	GPIO_InitStructure.GPIO_Pin = SD_SPI_SCK_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(SD_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);

	/*!< Configure SD_SPI pins: MOSI */
	GPIO_InitStructure.GPIO_Pin = SD_SPI_MOSI_PIN;
	GPIO_Init(SD_SPI_MOSI_GPIO_PORT, &GPIO_InitStructure);

	/*!< Configure SD_SPI pins: MISO */
	GPIO_InitStructure.GPIO_Pin = SD_SPI_MISO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(SD_SPI_MISO_GPIO_PORT, &GPIO_InitStructure);

	/*!< Configure SD_CS_PIN pin: SD CS pin */
	GPIO_InitStructure.GPIO_Pin = SD_SPI_CS_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(SD_SPI_CS_GPIO_PORT, &GPIO_InitStructure);

	SD_CS_DISABLE();

	/* Initialize SPI Peripheral */
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial = 7;
	SPI_Init(SD_SPI_PORT, &SPI_InitStructure);

	/* SPI2 enable */
	SPI_Cmd(SD_SPI_PORT, ENABLE);


	u8 r1; // return value of SD card storage
	u16 retry; // used to count out
	u8 buff[6] = {0,0,0,0,0};
	u8 ret;

	sd_setSpiSpeed(SPI_SPEED_256);

	// start transmission
	ret = sd_readWriteByte(0xff);

	if (SD_Idle_Sta())
		return 1; 	// 1 set out to return to the idle mode failed

	//----------------- SD card is reset to the idle end of the -----------------
	// Get the SD card version
	SD_CS_ENABLE();

	r1 = SD_SendCommand_NoDeassert (8, 0x1aa, 0x87);

	// If the version information is the v1.0 version of the card, ie r1 = 0x05, then the following initialization
	if (r1 == 0x05)
	{
		// Set the card type to SDV1.0, if the latter is detected as the MMC card, and then modified to MMC
		SD_Type = SD_TYPE_V1;
		// If the V1.0 card, CMD8 instruction did not follow-up data
		// Set chip select high end of the second order
		SD_CS_ENABLE();

		// Multiple 8 CLK, so that the end of follow-up operation SD
		sd_readWriteByte (0xFF);

		//----------------- SD card, MMC card initialization -----------------
		// Initialize command CMD55 + ACMD41 Card
		// If there is response, that is the SD card, and the initialization is complete
		// No response, that is the MMC card, the corresponding additional initialization
		retry = 0;
		do
		{
			// Starting CMD55, should return 0x01; or wrong
			r1 = SD_SendCommand (CMD55, 0, 0);
			if (r1 == 0XFF) return r1; // if not 0xff, then sent to

			// Get the correct response, sent ACMD41, the return value should be 0x00, otherwise retry 200
			r1 = SD_SendCommand (ACMD41, 0, 0);

			retry++;
	    } while ((r1 != 0x00) && (retry <SD_MEMORY_RETRY_COUNT));

	    // Determine the correct response is the time-out or
	    // If response: is the SD card; did not respond: is the MMC card
	    //---------- MMC card for additional initialization started ------------
	    if (retry == SD_MEMORY_RETRY_COUNT)
	    {
			retry = 0;
			// Initialize command to send MMC card (not tested)
			do
			{
			    r1 = SD_SendCommand (1,0,0);
			    retry++;
			} while ((r1 != 0x00) && (retry <SD_MEMORY_RETRY_COUNT));

			if (retry == SD_MEMORY_RETRY_COUNT) return 1; // MMC card initialization timed out

			// Write card type
			SD_Type = SD_TYPE_MMC;
	    }

	    //---------- MMC card for additional initialization end ------------
	    // Set SPI high-speed mode
	    sd_setSpiSpeed(SPI_SPEED_4);
	    sd_readWriteByte (0xFF);

	    // Disable CRC check
	    r1 = SD_SendCommand (CMD59, 0, 0x95);
	    if (r1 != 0x00)
			return r1; // command error, returns r1

	    // Set Sector Size
	    r1 = SD_SendCommand (CMD16, 512, 0x95);
	    if (r1 != 0x00)
			return r1; // command error, returns r1
	    //----------------- SD card, MMC card initialization ended -----------------

