aytacdilek/NUCLEO_W5500/drivers/stm32f10x_sd.c
	}
	// SD Card for the V1.0 version of the initialization is complete

	// Here is the card initialization V2.0
	// Which need to read the OCR data, with a diagnosis or SD2.0HC Card SD2.0
	else if (r1 == 0x01)
	{
	    // V2.0 card, CMD8 command returns 4 bytes of data, and then to skip the end of the command
	    buff[0] = sd_readWriteByte (0xFF); // should be 0x00
	    buff[1] = sd_readWriteByte (0xFF); // should be 0x00
	    buff[2] = sd_readWriteByte (0xFF); // should be 0x01
	    buff[3] = sd_readWriteByte (0xFF); // should be 0xAA

	    SD_CS_DISABLE();
	    sd_readWriteByte (0xFF); // the next 8 clocks
	    // Determine whether the card supports a voltage range of 2.7V-3.6V
	    // If (buff [2] == 0x01 && buff [3] == 0xAA) // do not judge, let the cards to support more
	    {
			retry = 0;
			// Initialize command CMD55 + ACMD41 Card
			do
			{
				r1 = SD_SendCommand (CMD55, 0, 0);
				if (r1 != 0x01) return r1;

				r1 = SD_SendCommand (ACMD41, 0x40000000, 0);
				if (retry> SD_MEMORY_RETRY_COUNT) return r1; // timeout return status r1
			} while (r1 != 0);

			// Initialize command to send to complete, the next access to OCR information
			// SD2.0 card identification since version
			//----------- -----------
			r1 = SD_SendCommand_NoDeassert (CMD58, 0, 0);
			if (r1 != 0x00)
			{
				SD_CS_DISABLE(); // release chip select signal SD
				return r1; // If the command does not return the correct response, direct withdrawal, return response
			} // Read OCR command is issued, followed by 4 bytes of OCR information

			buff [0] = sd_readWriteByte (0xFF);
			buff [1] = sd_readWriteByte (0xFF);
			buff [2] = sd_readWriteByte (0xFF);
			buff [3] = sd_readWriteByte (0xFF);

			// OCR to receive complete set of high chip select
			SD_CS_DISABLE();
			sd_readWriteByte (0xFF);

			// Check the received OCR in bit30-bit (CCS), was identified as SD2.0 SDHC
			// If the CCS = 1: SDHC CCS = 0: SD2.0
			if (buff [0] & 0x40)
				SD_Type = SD_TYPE_V2HC; // Check the CCS
			else
				SD_Type = SD_TYPE_V2;
			//----------- Identification card version of SD2.0 end -----------
			// Set SPI high-speed mode
			sd_setSpiSpeed(SPI_SPEED_4);
	    }
	}
	return r1;
}

/*******************************************************************************
* Function:		sd_setSpiSpeed
* Description:	SPI speed setting function
* Input:		SpeedSet:
* 				SPI_SPEED_2 2 frequency (SPI 36M @ sys 72M)
* 				SPI_SPEED_4 4 frequency (SPI 18M @ sys 72M)
* 				SPI_SPEED_8 8 frequency (SPI 9M @ sys 72M)
* 				SPI_SPEED_16 16 frequency (SPI 4.5M @ sys 72M)
* 				SPI_SPEED_256 256 frequency (SPI 281.25K @ sys 72M)
* Output:		None
* Return:		None
* Attention:	None
*******************************************************************************/
void sd_setSpiSpeed(uint8_t speed){
	SD_SPI_PORT->CR1 &= 0XFFC7; // Fsck = Fcpu/256
	switch (speed)
	{
		case SPI_SPEED_2: // Second division
			SD_SPI_PORT->CR1 |= 0<<3; // Fsck = Fpclk / 2 = 36Mhz
			break;
		case SPI_SPEED_4: // four-band
			SD_SPI_PORT-> CR1 |= 1<<3; // Fsck = Fpclk / 4 = 18Mhz
			break;
		case SPI_SPEED_8: // eighth of the frequency
			SD_SPI_PORT-> CR1 |= 2<<3; // Fsck = Fpclk / 8 = 9Mhz
			break;
		case SPI_SPEED_16: // sixteen frequency
			SD_SPI_PORT-> CR1 |= 3<<3; // Fsck = Fpclk/16 = 4.5Mhz
			break;
		case SPI_SPEED_256: // 256 frequency division
			SD_SPI_PORT-> CR1 |= 7<<3; // Fsck = Fpclk/16 = 281.25Khz
			break;
	}
	SD_SPI_PORT->CR1 |= 1<<6; // SPI devices enable
}


/*******************************************************************************
* Function:		sd_readWriteByte
* Description:	Initializes the peripherals used by the W5500 driver.
* Input:		One Byte Data to Write
* Output:		None
* Return:		One Byte Data to Read
* Attention:	None
*******************************************************************************/
uint8_t sd_readWriteByte (uint8_t tx_data){
	u16 retry=0;

	/* Loop while DR register in not emplty */
	while (SPI_I2S_GetFlagStatus (SD_SPI_PORT, SPI_I2S_FLAG_TXE) == RESET)
	{
		retry++;
		if(retry>400)
			return 0;
	}

	/* Send byte through the SPI2 peripheral */
	SPI_I2S_SendData (SD_SPI_PORT, tx_data);

	retry=0;

	/* Wait to receive a byte */
	while (SPI_I2S_GetFlagStatus (SD_SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET)
	{
		retry++;

		if(retry>400)
			return 0;
	}

	/* Return the byte read from the SPI bus */
	return SPI_I2S_ReceiveData (SD_SPI_PORT);
}


/*******************************************************************************
* Function:		getMountedMemorySize
* Description:	Initializes the peripherals used by the W5500 driver.
* Input:		One Byte Data to Write
* Output:		None
* Return:		One Byte Data to Read
* Attention:	None
*******************************************************************************/
FRESULT sd_getMountedMemorySize(uint8_t mount_ret, uint32_t * totalSize, uint32_t * availableSize)
{
	FATFS *fs;
	DWORD fre_clust, fre_sect, tot_sect;
	FRESULT res;

	/* Get volume information and free clusters of drive 1 */
	if(mount_ret == SPI_FLASHM)
		res = f_getfree("0:", &fre_clust, &fs);
	else if((mount_ret >= CARD_MMC) && (mount_ret <= CARD_SDHC))
		res = f_getfree("1:", &fre_clust, &fs);

	if (!res){
		/* Get total sectors and free sectors */
		tot_sect = (fs->n_fatent - 2) * fs->csize;
		fre_sect = fre_clust * fs->csize;

		/* Print the free space (assuming 512 bytes/sector) */
		//printf(" - Available memory size : %8ld / %8ld kB\r\n", fre_sect / 2, tot_sect / 2);

		*totalSize = tot_sect / 2;
		*availableSize = fre_sect / 2;
	}

	return res;
}

/*******************************************************************************
* Function:		getMountedMemorySize
* Description:	Initializes the peripherals used by the W5500 driver.
* Input:		One Byte Data to Write
* Output:		None
* Return:		One Byte Data to Read
* Attention:	None
*******************************************************************************/
uint64_t sd_getAvailableMemorySize(void){
	uint64_t size = 4096;

	return size;
}



void sd_displayCardInfo(uint8_t mount_ret){
	uint32_t totalSize = 0, availableSize = 0;

	printf("\r\n - Storage mount succeed\r\n");
	printf(" - Type : ");

	switch(mount_ret)
	{
		case CARD_MMC:
			printf("MMC\r\n"); 	break;
		case CARD_SD:
			printf("SD\r\n"); 	break;
		case CARD_SD2:
			printf("SD2\r\n"); 	break;
		case CARD_SDHC:
			printf("SDHC\r\n"); break;
		case SPI_FLASHM:
			printf("sFlash\r\n"); break;
		default:
			printf("\r\n"); 	break;
	}

#if 1
	if(_MAX_SS == 512)
	{
		sd_getMountedMemorySize(mount_ret, &totalSize, &availableSize);
		printf(" - Available Memory Size : %d kB / %d kB ( %d kB is used )\r\n", availableSize, totalSize, (totalSize - availableSize));
	}
	printf("\r\n");
#endif
}


// Wait for response to SD card
// Response: to get the feedback value
// Return value: 0, success has been the value of the response
// Otherwise, get the value of failure to respond
u8 SD_GetResponse (u8 Response)
{
	u16 Count = 0xFFF; // wait times

