aytacdilek/NUCLEO_W5500/drivers/stm32f10x_sd.c
	while ((sd_readWriteByte (0XFF) != Response) && Count)
		Count--; // waiting to get an accurate response

	if (Count == 0)
		return MSD_RESPONSE_FAILURE; // get a response failure
	else
		return MSD_RESPONSE_NO_ERROR; // correct response
}


// Wait for write to complete the SD card
// Return value: 0 success;
// Other, error codes;
u8 SD_WaitDataReady (void)
{
	u8 r1 = MSD_DATA_OTHER_ERROR;
	u32 retry;
	retry = 0;
	do
	{
       	 r1 = sd_readWriteByte (0xFF) &0X1F; // read response

        	if (retry == 0xfffe)
			return 1;

		retry++;

		switch (r1)
		{
		case MSD_DATA_OK: // correct the data reception
			r1 = MSD_DATA_OK;
			break;
		case MSD_DATA_CRC_ERROR: // CRC checksum error
			return MSD_DATA_CRC_ERROR;
		case MSD_DATA_WRITE_ERROR: // Data write error
			return MSD_DATA_WRITE_ERROR;
		default: // Unknown error
			r1 = MSD_DATA_OTHER_ERROR;
		break;
		}
	} while (r1 == MSD_DATA_OTHER_ERROR); // data errors have been waiting for

	retry = 0;
	while (sd_readWriteByte (0XFF) == 0) // read data to 0, the data has not yet completed writing
	{
		retry++;

		// Delay_us (10); // SD card write takes a long time to wait
		if (retry >= 0XFFFFFFFE)
			return 0XFF; // Wait failed
	};
	return 0; // success
}



// Send a command to the SD card
// Input: u8 cmd command
// U32 arg command arguments
// U8 crc crc checksum
// Return value: SD card, the response returned
u8 SD_SendCommand (u8 cmd, u32 arg, u8 crc)
{
	u8 r1;
	u16 Retry = 0;

	// Close the chip select
	SD_CS_DISABLE();

	sd_readWriteByte (0xff); // high-speed write command delay
	sd_readWriteByte (0xff);
	sd_readWriteByte (0xff);

	// Chip select low-end set, select the SD card
	SD_CS_ENABLE();

	// Send
	sd_readWriteByte (cmd | 0x40); // write command, respectively,
	sd_readWriteByte (arg>> 24);
	sd_readWriteByte (arg>> 16);
	sd_readWriteByte (arg>> 8);
	sd_readWriteByte (arg);
	sd_readWriteByte (crc);

	// Wait for a response, or time-out exit
	while ((r1 = sd_readWriteByte (0xFF)) == 0xFF)
	{
		Retry++;
		if (Retry> SD_MEMORY_RETRY_COUNT)
			break;
	}

	// Close the chip select
	SD_CS_DISABLE();

	// Additional 8 on the bus clock, so that SD card to complete the remaining work
	sd_readWriteByte (0xFF);

	// Return status values
	return r1;

}


// Send a command to the SD card (the end is yet to chip select, there came the follow-up data)
// Input: u8 cmd command
// U32 arg command arguments
// U8 crc crc checksum
// Return value: SD card, the response returned
u8 SD_SendCommand_NoDeassert (u8 cmd, u32 arg, u8 crc)
{
	u16 Retry = 0;
	u8 r1;

	sd_readWriteByte (0xff); // high-speed write command delay
	sd_readWriteByte (0xff);

	// chip select low-end set, select the SD card
	SD_CS_ENABLE();

	// Send
	sd_readWriteByte (cmd | 0x40); // write command, respectively,
	sd_readWriteByte (arg>> 24);
	sd_readWriteByte (arg>> 16);
	sd_readWriteByte (arg>> 8);
	sd_readWriteByte (arg);
	sd_readWriteByte (crc);

	// Wait for a response, or time-out exit
	while ((r1 = sd_readWriteByte (0xFF)) == 0xFF)
	{
	    Retry++;
	    if (Retry> SD_MEMORY_RETRY_COUNT)
			break;
	}

	// Return the response value
	return r1;
}



// Set the SD card into suspend mode
// Return value: 0, successfully set
// 1, setup failed
u8 SD_Idle_Sta (void)
{
	u16 i;
	u8 r1=0;
	u16 retry;

	for (i = 0; i <0xf00; i++);// pure delay, waiting for complete power-SD card

	// Should generate> 74 pulses, so that SD card to complete their initialization
	for (i = 0; i <10; i++) sd_readWriteByte (0xFF);

	//----------------- SD card is reset to the idle start -----------------
	// Loop continuously sending CMD0, until the SD card back 0x01, enter the IDLE state
	// Timeout then exit
	retry = 0;
	do
	{
		// Send CMD0, so that SD card into the IDLE state
		r1 = SD_SendCommand (CMD0, 0, 0x95);
		retry++;
	} while ((r1 != 0x01) && (retry <SD_MEMORY_RETRY_COUNT));

	// Exit the loop, check reason: Initialization successful? or try out?
	if (retry == SD_MEMORY_RETRY_COUNT) return 1; // fail

	return 0; // success
}


// Read back from the SD card in the specified length of data placed in a given position
// Input: u8 * data (read back the data storage memory> len)
// U16 len (data length)
// U8 release (whether to release the bus after transfer CS is set high 0: do not release 1: Release)
// Return value: 0: NO_ERR
// Other: Error Message
u8 SD_ReceiveData (u8 * data, u16 len, u8 release)
{
	// Start the first transfer
	SD_CS_ENABLE();
	if (SD_GetResponse (0xFE)) // wait for data sent back to the starting SD card token 0xFE
	{
		SD_CS_DISABLE();
		return 1;
	}

	while (len--) // Start receiving data
	{
		*data = sd_readWriteByte (0xFF);
		data++;
	}

	// Here are two pseudo-CRC (dummy CRC)
	sd_readWriteByte (0xFF);
	sd_readWriteByte (0xFF);
	if (release == RELEASE) // demand the release of the bus, the CS is set high
	{
		SD_CS_DISABLE(); // end of transmission
		sd_readWriteByte (0xFF);
	}
	return 0;
}

// Get the SD card CID information, including manufacturer information
// Input: u8 * cid_data (CID stored in the memory, at least 16Byte)
// Return value: 0: NO_ERR
// 1: TIME_OUT
// Other: Error Message
u8 SD_GetCID (u8 * cid_data)
{
	u8 r1;

	// Send CMD10 command, read CID
	r1 = SD_SendCommand(CMD10,0,0xff);

	if (r1 != 0x00)
		return r1; // do not return the correct answer, then exit, error

	SD_ReceiveData (cid_data, 16, RELEASE); // 16 bytes of data received
	return 0;
}

// Get the SD card, CSD, including the capacity and speed of information
// Input: u8 * cid_data (CID stored in the memory, at least 16Byte)
// Return value: 0: NO_ERR
// 1: TIME_OUT
// Other: Error Message
u8 SD_GetCSD (u8 *csd_data)
{
	u8 r1;

	r1 = SD_SendCommand(CMD9, 0, 0xff); // send CMD9 command, read CSD

	if (r1)
		return r1; // do not return the correct answer, then exit, error

	SD_ReceiveData (csd_data, 16, RELEASE); // 16 bytes of data received

