aytacdilek/NUCLEO_W5500/drivers/stm32f10x_sd.c
	return 0;
}

// Get the SD card capacity (bytes)
// Return value: 0: take capacity error
// Other: SD card capacity (bytes)
u32 SD_GetCapacity (void)
{
	u8 csd [16];
	u32 Capacity;
	u8 r1;
	u16 i;
	u16 temp;
	// Get CSD information, if during the error, return 0
	if (SD_GetCSD (csd) != 0) return 0;

	// If the SDHC card, calculated in accordance with the following
	if ((csd [0] & 0xC0) == 0x40)
	{
		Capacity = ((u32) csd [8]) <<8;
		Capacity += (u32) csd [9] +1;
		Capacity = (Capacity) * 1024; // get number of sectors
		Capacity *= 512; // get number of bytes
	}
	else
	{
		//int j;

		//for(j=0;j<16;j++)
		//	usart1_transmit_string_format("%x\r\n", csd[j]);

		i = csd [6] &0x03;
		//usart1_transmit_string_format("\r\ni=%x", i);
		i <<= 8;
		//usart1_transmit_string_format("\r\ni=%x", i);
		i += csd [7];
		//usart1_transmit_string_format("\r\ni=%x", i);
		i <<= 2;
		//usart1_transmit_string_format("\r\ni=%x", i);
		i += ((csd [8] & 0xc0)>> 6);
		//usart1_transmit_string_format("\r\ni=%x", i);

		// C_SIZE_MULT
		r1 = csd [9] &0x03;
		r1 <<= 1;
		r1 += ((csd [10] & 0x80)>> 7);
		r1 += 2; // BLOCKNR
		temp = 1;

		while (r1)
		{
			temp *= 2;
			r1--;
		}

		Capacity = ((u32) (i +1 ))*(( u32) temp);

		//usart1_transmit_string_format("\r\ntemp=%d,  Capacity=%d, i=%d\r\n", temp, Capacity, i);

		// READ_BL_LEN
		i = csd [5] &0x0f;

		// BLOCK_LEN
		temp = 1;

		while (i)
		{
			temp *= 2;
			i--;
		}

		//usart1_transmit_string_format("\r\\ntemp=%d,  Capacity=%d Bytes\r\n", temp, Capacity);

		// The final result
		Capacity *= (u32) temp; // in bytes
	}
	return (u32) Capacity;
}

// Read a block SD card
// Input: u32 sector to take the address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// Return value: 0: Success
// Other: failure
u8 SD_ReadSingleBlock (u32 sector, u8 * buffer)
{
	u8 r1;

	// Set to high-speed mode
	// bsp_set_spi2_speed(SPI_SPEED_4);

	// If it is not SDHC, given that the sector address, convert it into a byte address
	if (SD_Type != SD_TYPE_V2HC)
	{
	    sector = sector <<9;
	}

	r1 = SD_SendCommand (CMD17, sector, 0); // read command

	if (r1 != 0x00) return r1;

	r1 = SD_ReceiveData (buffer, 512, RELEASE);
	if (r1 != 0)
		return r1; // read data error!
	else
		return 0;
}


//////////////////////////// Function of the following two required
/////////// USB reader //////////////
// Define block size SD card
#define BLOCK_SIZE 512

// Write MSD / SD data
// PBuffer: Data Storage
// ReadAddr: writing the first address
// NumByteToRead: number of bytes to write
// Return value: 0, write to complete
// Otherwise, write failure
u8 MSD_WriteBuffer (u8 * pBuffer, u32 WriteAddr, u32 NumByteToWrite)
{
	u32 i, NbrOfBlock = 0, Offset = 0;
	u32 sector;
	u8 r1;

	NbrOfBlock = NumByteToWrite / BLOCK_SIZE; // get the number of blocks to be written
	SD_CS_ENABLE();

	while (NbrOfBlock--) // write a sector
	{
		sector = WriteAddr + Offset;
		if (SD_Type == SD_TYPE_V2HC) sector >>= 9; // perform the reverse operation and common action

		r1 = SD_SendCommand_NoDeassert (CMD24, sector, 0xff); // write command
		if (r1)
		{
			SD_CS_DISABLE();
			return 1; // response is not correct, a direct return
		}

		sd_readWriteByte (0xFE); // put initial token 0xFE

		// Put data in a sector
		for (i = 0; i <512; i++)
			sd_readWriteByte (*pBuffer++);

		// Send the dummy CRC Byte 2
		sd_readWriteByte (0xff);
		sd_readWriteByte (0xff);

		if (SD_WaitDataReady ())// SD card data is written to wait for the completion
		{
			SD_CS_DISABLE();
			return 2;
		}

		Offset += 512;
	}

	// Write completed, set to 1 chip select
	SD_CS_DISABLE();
	sd_readWriteByte (0xff);

	return 0;

}
// Read the MSD / SD data
// PBuffer: Data Storage
// ReadAddr: Read the first address
// NumByteToRead: number of bytes to read
// Return value: 0, read out the complete
// Others, read failure
u8 MSD_ReadBuffer (u8 * pBuffer, u32 ReadAddr, u32 NumByteToRead)
{
	u32 NbrOfBlock = 0, Offset = 0;
	u32 sector = 0;
	u8 r1 = 0;

	NbrOfBlock = NumByteToRead / BLOCK_SIZE;

	SD_CS_ENABLE();

	while (NbrOfBlock--)
	{
		sector = ReadAddr + Offset;
		if (SD_Type == SD_TYPE_V2HC)
			sector >>= 9; // perform the reverse operation and common action

		r1 = SD_SendCommand_NoDeassert (CMD17, sector, 0xff); // read command
		if (r1) // command to send an error
		{
			SD_CS_DISABLE();
			return r1;
		}

		r1 = SD_ReceiveData (pBuffer, 512, RELEASE);
		if (r1) // reading error
		{
			SD_CS_DISABLE();
			return r1;
		}

		pBuffer += 512;
		Offset += 512;
	}

	SD_CS_DISABLE();
	sd_readWriteByte (0xff);

	return 0;
}
//////////////////////////////////////////////////////////////////////////
// Write SD card, a block (not actually tested)
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// Return value: 0: Success
// Other: failure
u8 SD_WriteSingleBlock (u32 sector, const u8 * data)
{
	u8 r1;
	u16 i;
	u16 retry;

	// Set to high-speed mode
	// SPIx_SetSpeed(SPI_SPEED_HIGH);

	// If it is not SDHC, given that the sector address, convert it into a byte address
	if (SD_Type != SD_TYPE_V2HC)
	{
		sector = sector <<9;
	}

	r1 = SD_SendCommand (CMD24, sector, 0x00);
	if (r1 != 0x00)
	{
		return r1; // response is not correct, a direct return
	}

	// Start preparing data
	SD_CS_ENABLE();
	// First put three empty data, SD card ready to wait
	sd_readWriteByte (0xff);
	sd_readWriteByte (0xff);
	sd_readWriteByte (0xff);
	// Put initial token 0xFE
	sd_readWriteByte (0xFE);

	// Put data in a sector
	for (i = 0; i <512; i++)
	{
		sd_readWriteByte (* data++);
	}

	// Send a dummy CRC Byte 2
	sd_readWriteByte (0xff);
	sd_readWriteByte (0xff);

	// Wait for answer SD Card
	r1 = sd_readWriteByte (0xff);
	if ((r1 & 0x1F) != 0x05)
	{
	    SD_CS_DISABLE();
	    return r1;
	}

	// Wait operation is completed
	retry = 0;
	while ( !sd_readWriteByte (0xff))
	{
	    retry++;
	    if (retry> 0xfffe) // if not done for a long time to write, error exit
	    {
	        SD_CS_DISABLE();
	        return 1; // write timeout return 1
	    }
	}
	// Write completed, set to 1 chip select
	SD_CS_DISABLE();
	sd_readWriteByte (0xff);

