aytacdilek/NUCLEO_W5500/drivers/stm32f10x_sd.c
	return 0;
}

// Read more than one SD card block (actually tested)
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// U8 count one continuous block read count
// Return value: 0: Success
// Other: failure
u8 SD_ReadMultiBlock (u32 sector, u8 * buffer, u8 count)
{
    u8 r1;

	// SPIx_SetSpeed(SPI_SPEED_HIGH); // set to high-speed mode

	// If it is not SDHC, the sector addresses turn into a byte address
	if (SD_Type != SD_TYPE_V2HC)
		sector = sector <<9;

	// SD_WaitDataReady ();
	// Read multi-block commands issued
	r1 = SD_SendCommand (CMD18, sector, 0); // read command
	if (r1 != 0x00) return r1;

	do // Start receiving data
	{
	    if (SD_ReceiveData (buffer, 512, NO_RELEASE) != 0x00) break;
	    buffer += 512;
	} while (--count);

	// All the transmission is completed, send the stop command
	SD_SendCommand (CMD12, 0, 0);

	// Release bus
	SD_CS_DISABLE();
	sd_readWriteByte (0xFF);

	if (count != 0)
		return count; // end if not passed, return the remaining number of
	else
		return 0;

}
// Write SD card, N-block (not actually tested)
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buffer data storage location (size at least 512byte)
// U8 count the number of write block
// Return value: 0: Success
// Other: failure
u8 SD_WriteMultiBlock (u32 sector, const u8 * data, u8 count)
{
	u8 r1;
	u16 i;

	// SPIx_SetSpeed (SPI_SPEED_HIGH); // set to high-speed mode

	if (SD_Type != SD_TYPE_V2HC)
		sector = sector <<9; // If it is not SDHC, given that the sector address, convert it to byte address
	if (SD_Type != SD_TYPE_MMC)
		r1 = SD_SendCommand (ACMD23, count, 0x00); // If the target card is not the MMC card, enable the command to enable pre-erase ACMD23

	r1 = SD_SendCommand (CMD25, sector, 0x00); // send multi-block write command
	if (r1 != 0x00)
		return r1; // response is not correct, a direct return

	SD_CS_ENABLE(); // start preparing data

	sd_readWriteByte (0xff); // first put three empty data, SD card ready to wait
	sd_readWriteByte (0xff);
	//-------- The following is written by N-loop part of the sector

	do
	{
		// Put the start token that is a multi-block write 0xFC
		sd_readWriteByte (0xFC);
		// Put data in a sector
		for (i = 0; i <512; i++)
		{
			sd_readWriteByte (* data++);
		}
		// Send a dummy CRC Byte 2
		sd_readWriteByte (0xff);
		sd_readWriteByte (0xff);

		// Wait for answer SD Card
		r1 = sd_readWriteByte (0xff);
		if ((r1 & 0x1F) != 0x05)
		{
			SD_CS_DISABLE(); // If the response is an error, then exit with error code
			return r1;
		}
		// Wait for write to complete the SD card
		if (SD_WaitDataReady () == 1)
		{
			SD_CS_DISABLE(); // wait for write to complete the SD card out, exit error
			return 1;
		}
	} while (--count); // completion of the sector data transfer

	// Send end of the transmission token 0xFD
	r1 = sd_readWriteByte (0xFD);
	if (r1 == 0x00)
	{
		count = 0xfe;
	}

	if (SD_WaitDataReady ()) // wait for ready
	{
		SD_CS_DISABLE();
		return 1;
	}
	// Write completed, set to 1 chip select
	SD_CS_DISABLE();
	sd_readWriteByte (0xff);

	return count; // return count value, if finished then count = 0, otherwise, count = 1

}
// In the specified sector, began to read out bytes from the offset byte
// Input: u32 sector sector address (sector value, non-physical address)
// U8 * buf data storage addresses (size <= 512byte)
// U16 offset offset inside the sector
// U16 bytes number of bytes to read
// Return value: 0: Success
// Other: failure
u8 SD_Read_Bytes (unsigned long address, unsigned char * buf, unsigned int offset, unsigned int bytes)
{
	u8 r1; u16 i = 0;
	r1 = SD_SendCommand (CMD17, address <<9,0); // send the Read Sector command

	if (r1)
		return r1; // response is not correct, a direct return

	SD_CS_ENABLE(); // select the SD card

	if (SD_GetResponse (0xFE)) // wait for data sent back to the starting SD card token 0xFE
	{
		SD_CS_DISABLE(); // close the SD card
		return 1; // read failure
	}

	for (i = 0; i <offset; i++) sd_readWriteByte (0xff); // skip the offset bits
	for (; i <offset + bytes; i++) * buf++= sd_readWriteByte (0xff); // read the useful data
	for (; i <512; i++) sd_readWriteByte (0xff); // read the remaining bytes

	sd_readWriteByte (0xff); // send the pseudo-code CRC
	sd_readWriteByte (0xff);

	SD_CS_DISABLE(); // close the SD card

	return 0;
}

u8 SD_WaitReady(void)
{
    u8 r1;
    u16 retry;
    retry = 0;
    do
    {
        r1 = sd_readWriteByte(0xFF);
        if(retry==0xfffe)
        {
            return 1;
        }
    }while(r1!=0xFF);

    return 0;
}








MemoryType_Enum mmc_mount(void)
{
	FRESULT res;
    u8 state;

#if !defined(F_SPI_FLASH_ONLY)
	state = sd_init();
#if defined(_FS_DEBUG_)
    printf("SD_Init:%d\r\n", state);
#endif
	if(state == STA_NODISK)
	{
		return NO_CARD;
	}
	else if(state != 0)
	{
		return NO_CARD;
	}
	else
	{
		res = f_mount(&Fatfs[0],"1:",0);
#if defined(_FS_DEBUG_)
	    printf("f_mount:%d\r\n", res);
#endif
		g_sdcard_done = 1;

		return SD_Type;
	}
#endif
	return NO_CARD;//0
}

uint8_t flash_mount()
{
#if 0
	if(mmc_init())
	{
		f_mount(0, &ff);
		return card_type;
	}
#else
	FRESULT res;

	DataFlash_Init();

	//disk_initialize(1);

	res = f_mount(&Fatfs[0],"0:",0);
#if defined(_FS_DEBUG_)
    printf("f_mount:%d\r\n", res);
#endif

#if defined(F_SPI_FLASH)
    if(check_spiflash_flag() == 1)
        g_mkfs_done = 1;
    else
        g_mkfs_done = 0;

	res = f_mkfs("0:",0,512);

#if defined(_FS_DEBUG_)
    printf("f_mkfs:%d %d\r\n", res, g_mkfs_done);
#endif
    if(check_spiflash_flag() == 1)
    	save_spiflash_flag();
    g_mkfs_done = 1;
#endif

	return SPI_FLASHM;
#endif
}

//*****************************************************************************

#ifdef STM32_SD_USE_DMA
/*-----------------------------------------------------------------------*/
/* Transmit/Receive Block using DMA (Platform dependent. STM32 here)     */
/*-----------------------------------------------------------------------*/
static void stm32_dma_transfer(
	uint8_t receive,		/* FALSE(0) for buff->SPI, TRUE(1) for SPI->buff               */
	const BYTE *buff,		/* receive TRUE  : 512 byte data block to be transmitted
						   	receive FALSE : Data buffer to store received data    */
	uint16_t btr 			/* receive TRUE  : Byte count (must be multiple of 2)
						   	receive FALSE : Byte count (must be 512)              */
)
{
	DMA_InitTypeDef DMA_InitStructure;
	WORD rw_workbyte[] = { 0xffff };

	/* shared DMA configuration values */
	DMA_InitStructure.DMA_PeripheralBaseAddr = (DWORD)(&(SPI_SD->DR));
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_BufferSize = btr;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;

	DMA_DeInit(DMA_Channel_SPI_SD_RX);
	DMA_DeInit(DMA_Channel_SPI_SD_TX);

	if ( receive ) {

		/* DMA1 channel2 configuration SPI1 RX ---------------------------------------------*/
		/* DMA1 channel4 configuration SPI2 RX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD)buff;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
		DMA_Init(DMA_Channel_SPI_SD_RX, &DMA_InitStructure);

		/* DMA1 channel3 configuration SPI1 TX ---------------------------------------------*/
		/* DMA1 channel5 configuration SPI2 TX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD)rw_workbyte;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Disable;
		DMA_Init(DMA_Channel_SPI_SD_TX, &DMA_InitStructure);

	} else {

#if _FS_READONLY == 0
		/* DMA1 channel2 configuration SPI1 RX ---------------------------------------------*/
		/* DMA1 channel4 configuration SPI2 RX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD)rw_workbyte;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Disable;
		DMA_Init(DMA_Channel_SPI_SD_RX, &DMA_InitStructure);

		/* DMA1 channel3 configuration SPI1 TX ---------------------------------------------*/
		/* DMA1 channel5 configuration SPI2 TX ---------------------------------------------*/
		DMA_InitStructure.DMA_MemoryBaseAddr = (DWORD)buff;
		DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
		DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
		DMA_Init(DMA_Channel_SPI_SD_TX, &DMA_InitStructure);
#endif

	}

	/* Enable DMA RX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_RX, ENABLE);
	/* Enable DMA TX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_TX, ENABLE);

	/* Enable SPI TX/RX request */
	SPI_I2S_DMACmd(SPI_SD, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, ENABLE);

	/* Wait until DMA1_Channel 3 Transfer Complete */
	/// not needed: while (DMA_GetFlagStatus(DMA_FLAG_SPI_SD_TC_TX) == RESET) { ; }
	/* Wait until DMA1_Channel 2 Receive Complete */
	while (DMA_GetFlagStatus(DMA_FLAG_SPI_SD_TC_RX) == RESET) { ; }
	// same w/o function-call:
	// while ( ( ( DMA1->ISR ) & DMA_FLAG_SPI_SD_TC_RX ) == RESET ) { ; }

	/* Disable DMA RX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_RX, DISABLE);
	/* Disable DMA TX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_TX, DISABLE);

	/* Disable SPI RX/TX request */
	SPI_I2S_DMACmd(SPI_SD, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, DISABLE);
}
#endif /* STM32_SD_USE_DMA */
